// Завдання 2.2.
// 11.	Дана послідовність цілих позитивних чисел. Утворити нову послідовність, викинувши з вихідною ті члени, які дорівнюють.

#include <iostream>
#include <cstdlib>
#include <ctime>
using namespace std;

const int MAX_SIZE = 100;

int main() {
    srand(time(NULL));
    int arr[MAX_SIZE]; 
    int n; 
    
    cout << "Введіть розмір масиву: ";
    cin >> n;
    cout << "Згенерований масив: ";
    for (int i = 0; i < n; i++) { 
        arr[i] = rand() % 6 + 1;
        cout << arr[i] << " ";
    }
    cout << endl;
    
    int frequency[MAX_SIZE] = {0};
    bool counted[MAX_SIZE] = {false};
    
    for (int i = 0; i < n; i++) {                   //підрахунок частоти кожного елемента
        if (!counted[i]) {
            frequency[i] = 1;
            for (int j = i + 1; j < n; j++) {
                if (arr[i] == arr[j]) {
                    frequency[i]++;
                    counted[j] = true; 
                }
            }
        }
    }

    int newArr[MAX_SIZE];           
    int newN = 0;
    
    for (int i = 0; i < n; i++) {                   //утворення нової послідовності
        if (!counted[i] && frequency[i] == 1) {
            newArr[newN] = arr[i];
            newN++;
        }
    }
    
    cout << "Нова послідовність: ";
    for (int i = 0; i < newN; i++) {
        cout << newArr[i] << " ";
    }
    return 0;
}

// При виконанні цього завдання було використано псевдодинамічний масив. Приклад його створення був взят з методички. Саме 
// в цьому рішенні числа генеруються від 1 до 6, щоб ми могли відстежити повтори при довжині масиву 7 та більше.

// Далі виконується підрахунок частоти кожного елемента за допомогою вкладеного циклу for. Зовнішній цикл проходить по всіх 
// елементах масиву, а оператор if перевіряє, чи цей елемент ще не був підрахований. Якщо елемент ще не враховано, змінній 
// frequency[i] присвоюється значення 1, після чого внутрішній цикл починає перевіряти всі наступні елементи масиву. При 
// знаходженні рівного елемента лічильник збільшується на 1, а відповідний елемент позначається як counted[j] = true, 
// щоб уникнути повторного підрахунку. Таким чином, для кожної унікальної групи елементів визначається, скільки разів 
// вона зустрічається в масиві.

// Далі утворюється нова послідовність. Цикл for проходить по всіх елементах вихідного масиву. Умовний оператор if перевіряє, чи 
// елемент є першим у своїй групі та чи зустрічається він лише один раз. Якщо умова виконується, елемент додається до нового масиву
// newArr, а лічильник newN збільшується. Так ми видаляємо всі елементи, які зустрічаються більше одного разу.



// Результат
// Введіть розмір масиву: 8
// Згенерований масив: 5 6 1 1 4 6 6 1 
// Нова послідовність: 5 4 